app/controllers/donations_controller.rb

SELECT "donations".* FROM "donations"
---
  def index
    @Donation = Donation.all

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @Donation = Donation.find(params[:id])

INSERT INTO "donations" ("cuenta", "banco", "detalle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cuenta", 987], ["banco", "pichincha"], ["detalle", "test"], ["created_at", "2018-07-22 21:10:57.478965"], ["updated_at", "2018-07-22 21:10:57.478965"]]
---
   def create
    @Donation = Donation.new(cuenta:params[:donation][:cuenta],banco:params[:donation][:banco],detalle:params[:donation][:detalle])

    if @Donation.save

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "donations" WHERE "donations"."id" = $1  [["id", 2]]
---
  def destroy
    @Donation = Donation.find(params[:id])
    @Donation.destroy

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @Donation = Donation.find(params[:id])

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "donations" SET "detalle" = $1, "updated_at" = $2 WHERE "donations"."id" = $3  [["detalle", "Enviar en dolares y Euros"], ["updated_at", "2018-07-22 21:18:51.844960"], ["id", 1]]
---
    def update
      @Donation = Donation.find(params[:id])
        if @Donation.update(donation_params)