app/controllers/events_controller.rb

  def index
    @Event = Event.all
---
SELECT "events".* FROM "events"

  def show
    @Event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

       def create
        @Event = Event.new(nombre:params[:event][:nombre],lugar:params[:event][:lugar],fecha:params[:event][:fecha],participantes:params[:event][:participantes])

        if @Event.save
---
INSERT INTO "events" ("nombre", "lugar", "fecha", "participantes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "piñata"], ["lugar", "casa"], ["fecha", "2018-05-13"], ["participantes", "muchos"], ["created_at", "2018-07-23 00:23:15.719278"], ["updated_at", "2018-07-23 00:23:15.719278"]]

  def destroy
    @Event = Event.find(params[:id])
    @Event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]

   def edit
    @Event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      @Event = Event.find(params[:id])
        if @Event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "participantes" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["participantes", "muchos masssssssssssss"], ["updated_at", "2018-07-23 00:47:32.392513"], ["id", 1]]