app/controllers/foundations_controller.rb

SELECT "foundations".* FROM "foundations"
---
  def index
    @Foundation = Foundation.all

SELECT  "foundations".* FROM "foundations" WHERE "foundations"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @Foundation = Foundation.find(params[:id])

INSERT INTO "foundations" ("nombre", "resumen", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "fundacion 2"], ["resumen", "fundacion 2"], ["created_at", "2018-07-22 17:04:33.900482"], ["updated_at", "2018-07-22 17:04:33.900482"]]
---
   def create
    @Foundation = Foundation.new(nombre:params[:foundation][:nombre],resumen:params[:foundation][:resumen],objeto:params[:foundation][:objeto],telefono:params[:foundation][:telefono],sitio_web:params[:foundation][:sitio_web])

    if @Foundation.save

SELECT  "foundations".* FROM "foundations" WHERE "foundations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "foundations" WHERE "foundations"."id" = $1  [["id", 3]]
---
  def destroy
    @Foundation = Foundation.find(params[:id])
    @Foundation.destroy

SELECT  "foundations".* FROM "foundations" WHERE "foundations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
   def edit
    @Foundation = Foundation.find(params[:id])

SELECT  "foundations".* FROM "foundations" WHERE "foundations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "foundations" SET "nombre" = $1, "resumen" = $2, "objeto" = $3, "updated_at" = $4 WHERE "foundations"."id" = $5  [["nombre", "fundacion 21"], ["resumen", "fundacion 21"], ["objeto", "fundacion 21"], ["updated_at", "2018-07-22 18:09:20.391747"], ["id", 4]]
---
    def update
      @Foundation = Foundation.find(params[:id])
        if @Foundation.update(foundation_params)