app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @Menu = Menu.all

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @Menu = Menu.find(params[:id])

INSERT INTO "menus" ("nombre", "enlace", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "test menu"], ["enlace", "http://www.google.com"], ["created_at", "2018-07-23 20:51:09.375252"], ["updated_at", "2018-07-23 20:51:09.375252"]]
---
   def create
    @Menu = Menu.new(nombre:params[:menu][:nombre],enlace:params[:menu][:enlace])

    if @Menu.save

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 2]]
---
  def destroy
    @Menu = Menu.find(params[:id])
    @Menu.destroy

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @Menu = Menu.find(params[:id])

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "menus" SET "nombre" = $1, "enlace" = $2, "updated_at" = $3 WHERE "menus"."id" = $4  [["nombre", "Fundaciones"], ["enlace", "/foundations"], ["updated_at", "2018-07-23 21:46:42.387695"], ["id", 1]]
---
    def update
      @Menu = Menu.find(params[:id])
        if @Menu.update(menu_params)