app/views/layouts/application.html.erb

  <div class="navbar-fixed">
  <% @Menu = Menu.all%>
---
SELECT "menus".* FROM "menus"